{
  "initializer_factor": 1.0,
  "model_type": "siglip",
  "text_config": {
    "hidden_size": 1024,
    "intermediate_size": 4096,
    "model_type": "siglip_text_model",
    "num_attention_heads": 16,
    "num_hidden_layers": 24,
    "projection_size": 1024,
    "vocab_size": 256000
  },
  "transformers_version": "4.49.0.dev0",
  "vision_config": {
    "hidden_size": 1024,
    "image_size": 256,
    "intermediate_size": 4096,
    "model_type": "siglip_vision_model",
    "num_attention_heads": 16,
    "num_hidden_layers": 24
  }
}
